morsehgp3D_v7/audits/receipts_cache_commit_20260911/mutants_groupes/inert_grouped.diff
--- /workspaces/E-HGP/build/ad7ffd28_v7_pin/morsehgp3D_v7/src/forest/full_ball_tower.hpp	2026-09-10 21:27:07.000000000 +0000
+++ /workspaces/E-HGP/build/ad7ffd28_replay/mutants/inert_grouped/src/forest/full_ball_tower.hpp	2026-09-11 08:03:06.686356885 +0000
@@ -711,6 +711,7 @@
     // Publish anchors only AFTER the complete atomic group has been staged.
     // Failure anywhere invalidates the whole result, not just this lot.
     for (size_t b = 0; b < blocks.size(); ++b) {
+      if (blocks[b].roots.size() == 1 && !blocks[b].contribution && !blocks[b].interior) continue;  // MUTANT groupe : ancre inerte omise
       require(anchors[blocks[b].ball] == absent && targets[b] != absent, "full_ball_anchor_duplicate");
       anchors[blocks[b].ball] = targets[b];
       seed_closed_anchor(blocks[b].ball, targets[b]);
