morsehgp3D_v7/audits/receipts_raccord_ancres_20260910/fixture_rayon_egal/mutant_strict_descent.diff
--- /tmp/claude-1000/-workspaces-E-HGP/6300a9ba-5bd7-42ea-91b3-d2c07c163916/scratchpad/overlay_wip_130402/src/forest/full_ball_tower.hpp	2026-09-10 13:07:49.344911853 +0000
+++ /tmp/claude-1000/-workspaces-E-HGP/6300a9ba-5bd7-42ea-91b3-d2c07c163916/scratchpad/overlay_mut_strict/src/forest/full_ball_tower.hpp	2026-09-10 13:17:11.649890096 +0000
@@ -321,7 +321,7 @@
       std::sort(sites.begin(), sites.end());
       auto next = meb(sites, st.resolve_work);
       const int cmp = compare_exact_level(next.level, local.level);
-      require(cmp <= 0, "full_ball_radius_increased");
+      require(cmp < 0, "mutant_strict_descent_only");  // MUTANT : refuse le rayon egal
       if (cmp == 0) {
         require(next.key == local.key && next.selected_shell_count + 1 == local.selected_shell_count,
                 "full_ball_equal_radius_shell_not_decreased");
