morsehgp3D_v7/receipts/witness_front_20260910/mutants/index_binding/change.patch
--- a/morsehgp3D_v7/src/pipeline/witness_front.hpp
+++ b/morsehgp3D_v7/src/pipeline/witness_front.hpp
@@ -56,7 +56,7 @@
   out->clear();
   if (!batch_size || s < kSeparationProfileMin || (initial_mask & ~u8{7}))
     throw std::invalid_argument("witness_front_options");
-  if (!ix.valid || !run.matches_index(ix))
+  if (!ix.valid)
     throw std::invalid_argument("witness_front_index_binding");
   if (ix.nodes.empty()) { *work = {}; return; }
   struct Task { WspdRect r; u8 mask; };
