morsehgp3D_v8/receipts/float32_identity_20260921/mutations/cases/global_translation_omitted/change.patch
--- src/core/float32_ball.cpp
+++ global_translation_omitted/src/core/float32_ball.cpp
@@ -205,6 +205,7 @@
     exact.scale = -exact.scale;
     for (auto& x : exact.linear) x = -x;
   }
+  exact.origin = {};  // MUTANT: interpret local coordinates as global.
   // A*|Q-a|^2-W.(Q-a), expanded in the single GLOBAL unit 2^-149.
   // q3: A<=12M^4, |B_i|<=60M^5, |C|<=144M^6, M=2^278.
   // q4: A<=6M^3, |B_i|<=30M^4, |C|<=72M^5. Degree<=6 fits 1728 bits.
