morsehgp3D_v8/receipts/float32_index_20260921/mutants/cases/internal_escape/change.patch
--- src/spatial/float32_index.cpp
+++ internal_escape/src/spatial/float32_index.cpp
@@ -147,7 +147,7 @@
   const auto right = build(order, scratch, middle, last, depth + 1);
   nodes_[current].left = left;
   nodes_[current].right = right;
-  nodes_[current].escape = nodes_.size();
+  nodes_[current].escape = nodes_.size() - 1;
   return current;
 }
 
