morsehgp3D_v8/receipts/float32_index_20260921/mutants/cases/open_box/change.patch
--- src/spatial/float32_index.cpp
+++ open_box/src/spatial/float32_index.cpp
@@ -173,7 +173,7 @@
       const auto nh = float32_order_key(node.box.high()[axis]);
       const auto ql = float32_order_key(query.low()[axis]);
       const auto qh = float32_order_key(query.high()[axis]);
-      if (nh < ql || nl > qh) { outside = true; break; }
+      if (nh <= ql || nl >= qh) { outside = true; break; }
       inside = inside && ql <= nl && nh <= qh;
     }
     if (outside) {
