morsehgp3D_v8/receipts/float32_index_20260921/mutants/cases/signed_zero/change.patch
--- src/spatial/float32_index.hpp
+++ signed_zero/src/spatial/float32_index.hpp
@@ -16,7 +16,6 @@
 
 // Total numerical order on finite binary32, with the two zero encodings equal.
 [[nodiscard]] inline std::uint32_t float32_order_key(std::uint32_t word) noexcept {
-  if ((word & 0x7fffffffU) == 0) word = 0;
   return (word & 0x80000000U) != 0 ? ~word : word ^ 0x80000000U;
 }
 
