morsehgp3D_v8/receipts/lidar_global_20260921/mutations/compiled_5slu1ek1/q3_shell_counted_inside.patch
--- morsehgp3D_v8/src/pipeline/wspd_q34.cpp
+++ mutated/wspd_q34.cpp
@@ -366,7 +366,7 @@
         ++visited;
         counter_add(q3.census_point_tests);
         const auto power = ball->power(points[id]);
-        if (power < 0) {
+        if (power <= 0) {
           counter_add(q3.census_inside_sites);
           if (++depth >= k_ - 1) {
             counter_add(q3.depth_rejections);
