morsehgp3D_v8/receipts/q34_affine_20260921/preflight/mutations/compiled_ztqh7g1n/local_exclusion_removes_global_lane.patch
--- morsehgp3D_v8/src/lanes/q34_witness_search.cpp
+++ mutated/wspd_q34.cpp
@@ -154,6 +154,7 @@
             counter_add(lane == 0 ? bounds_work->q3_excluded_nodes
                                   : bounds_work->q4_excluded_nodes);
             frame.mask &= static_cast<std::uint8_t>(~bit);
+            remaining &= static_cast<std::uint8_t>(~bit);
             continue;
           }
         }
