morsehgp3D_v8/receipts/q34_affine_20260921/preflight/mutations/compiled_ztqh7g1n/xi_upper_used_to_exclude.patch
--- morsehgp3D_v8/src/lanes/q34_witness_search.cpp
+++ mutated/wspd_q34.cpp
@@ -150,7 +150,7 @@
           // All products fit the same <2^72 bound as admission. Exclusion
           // removes ONLY this frame's lane, never remaining or its count.
           if (alpha * (static_cast<i128>(h.maximum4) * h.maximum4) <=
-              static_cast<i128>(16) * xi.low) {
+              static_cast<i128>(16) * xi.high) {
             counter_add(lane == 0 ? bounds_work->q3_excluded_nodes
                                   : bounds_work->q4_excluded_nodes);
             frame.mask &= static_cast<std::uint8_t>(~bit);
