morsehgp3D_v8/receipts/q34_seed_20260920/mutants/compiled_4cqzufx_/q4_stop_at_first_unowned.patch
--- morsehgp3D_v8/src/lanes/q34_seed.cpp
+++ mutated/q34_seed.cpp
@@ -107,7 +107,7 @@
       std::array<std::size_t, 4> support{seed_ids[0], seed_ids[1], seed_ids[2], y_id};
       if (!owned(points, support, work.q4_owner_tests)) {
         counter_add(work.q4_owner_rejections);
-        continue;
+        return;  // MUTANT: later root presentations lost
       }
       counter_add(work.q4_positive_tests);
       const auto ball = ExactBall::make_q4({a, b, x, y});
